<?php

 namespace mdl;

/*
 * 试题：
 * 20181011
 */
class app extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[

            //第一题
			[	//题目timu
				'tm'=>'你是否愿意不断地去学习那些新的东西？',
				//选项xuanxiang
				'xx'=>['是', '不是'],
				//答案daan
				'da'=>[1, 0]
			],
            
            //第二题
            [	//题目timu
				'tm'=>'当你遇到一些问题和困难的时候，你是否有足够的耐心和毅力去独自解决这些问题？',
				//选项xuanxiang
				'xx'=>['是', '不是'],
				//答案daan
				'da'=>[1, 0]
            ],
            

            //第三题
            [	//题目timu
				'tm'=>'以下软件中，（ ）不是操作系统？',
				//选项xuanxiang
				'xx'=>['Window XP', 'unix', 'linux', 'microsoft office'],
				//答案daan
				'da'=>[0,0,0,1,]
            ],
            

            //第四题
            [	//题目timu
				'tm'=>'下列设备中，属于输出设备的是（ ）？',
				//选项xuanxiang
				'xx'=>['显示器', '键盘', '鼠标', '手写板'],
				//答案daan
				'da'=>[1,0,0,0,]
            ],
            

            //第五题
            [	//题目timu
				'tm'=>'百度的网址是( )？',
				//选项xuanxiang
				'xx'=>['http://www.baidu.com', 'http://www.sina.com', 'http://www.163.com', 'http://www.sohu.com'],
				//答案daan
				'da'=>[1,0,0,0,]
            ],
            

            //第六题
            [	//题目timu
				'tm'=>'安卓的logo是( )？',
				//图片
				'img'=>'t1_app_5.jpg',
				//选项xuanxiang
				'xx'=>[],
				//答案daan
				'da'=>[1,0,]
            ],



            //第七题
            [	//题目timu
				'tm'=>' 1  8  27  ( )  请写出(  )内的数字？',
				//选项xuanxiang
				'xx'=>['30', '64', '37', '50'],
				//答案daan
				'da'=>[0,1,0,0]
            ],
            

            //第八题
            [	//题目timu
				'tm'=>'一个完整的计算机系统包括（ ）？',
				//选项xuanxiang
				'xx'=>['主机，键盘，显示器', '计算机及其外部设备','系统软件和应用软件','计算机的硬件系统和软件系统'],
				//答案daan
				'da'=>[0,0,0,1]
            ],
            


            //第九题
            [	//题目timu
				'tm'=>'电子邮件俗称”伊妹儿”是（ ）？',
				//选项xuanxiang
				'xx'=>['mailTo', 'BBS','E-mail','Usenet'],
				//答案daan
				'da'=>[0,0,1,0]
            ],

            //第十题
            [	//题目timu
				'tm'=>'因特网上专门提供网上搜索的工具是（ ）？',
				//选项xuanxiang
				'xx'=>['查找', '查询','搜索引擎','查看'],
				//答案daan
				'da'=>[0,0,1,0]
            ],

            //第十一题
            [	//题目timu
				'tm'=>'找出与众不同的一个（ ）？',
				//选项xuanxiang
				'xx'=>['触', '视','听','吃','嗅'],
				//答案daan
				'da'=>[0,0,0,1,0]
            ],


            //第十二题
            [	//题目timu
				'tm'=>'一条大街两旁的商店几乎没有霓虹灯，但都有遮篷。所以（ ）？',
				//选项xuanxiang
				'xx'=>['有些商店或者有遮篷或者有霓虹灯', '有些商店既有遮篷又有霓虹灯'],
				//答案daan
				'da'=>[0,1]
            ],
            

            //第十三题
            [	//题目timu
				'tm'=>'一本书的价格降低了50%。现在如果按原价出售，提高了百分之几？',
				//选项xuanxiang
				'xx'=>['25%', '50%','75%','100%','200%'],
				//答案daan
				'da'=>[0,0,0,1,0]
            ],

            //第十四题
            [	//题目timu
				'tm'=>'计算机在工作过程中突然断电，会丢失所保存信息的存储介质是（ ）？',
				//选项xuanxiang
				'xx'=>['光盘', '硬盘','只读存储器','内存'],
				//答案daan
				'da'=>[0,0,0,1]
            ],
            //第十五题
            [	//题目timu
				'tm'=>' 7643*2819-7644*2818 的值是( )？',
				//选项xuanxiang
				'xx'=>['4825', '4673','4673','5238'],
				//答案daan
				'da'=>[1,0,0,0]
            ],

		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;


		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
