<?php namespace mdl;

/*
 * 试题：互联网财务管理
 * 20181011
 */
class cw extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[	
				'tm'=>'下列各项目中不属于财务会计要素的是？',				 
				'xx'=>['资产','负债','财产','利润'],
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'不属于互联网电子商务平台的网站是？',
				'img'=>'t1_cw_1.jpg',//图片命名规则：t1_代号_数组的序号.jpg
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'会计的基本职能？',
				'xx'=>['记录和计算','考核收支','核算和监督','分析和考核'],
				'da'=>[0,0,1,0],
			],
			[
				'tm'=>'下面那个属于跨境电商平台？',
				'img'=>'t1_cw_3.jpg',
				'da'=>[0,0,1,0],
			],
			[
				'tm'=>'下列哪项不属于网络支付方式？',
				'img'=>'t1_cw_4.jpg',
				'da'=>[0,0,0,1],
			],
			[
				'tm'=>'在宋朝时期，我国会计采用的是？',
				'xx'=>['复式记账法','单式记账法','四柱结算法','增减记账法'],
				'da'=>[0,0,1,0],
			],
			[
				'tm'=>'互联网广告中，Banner的中文意思是？',
				'xx'=>['网站广告','横幅式广告','按钮式广告','墙纸式广告'],
				'da'=>[1,0,0,0],
			],
			[
				'tm'=>'BAT是中国互联网公司三巨头，下列不属于BAT公司的是？',
				'img'=>'t1_cw_7.jpg',
				'da'=>[0,0,1,0],
			],
			[
				'tm'=>'现代财务会计以（ ）作为主要的计量单位？',
				'xx'=>['实物量度','劳动工时量度','货币量度','以上任何一种都可以'],
				'da'=>[0,0,1,0],
			],
			[
				'tm'=>'不属于互联网电子商务平台的网站是？',
				'img'=>'t1_cw_9.jpg',
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'淘宝网用户购物时聊天的工具是什么？',
				'img'=>'t1_cw_9.jpg',
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'在我国，制定会计准则和会计制度的机构是？',
				'xx'=>['国家税务总局','财政部','主管部门','企业自身'],
				 
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'记账凭证的填制是由（ ）填制的？',
				'xx'=>['出纳人员','会计人员','经办人员','主管人员'],		 
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'1997年首家推出国内“一网通”网上支付工具的商业银行是？',
				'img'=>'t1_cw_12.jpg',			 
				'da'=>[0,1,0,0],
			],
			[
				'tm'=>'销售产品一批，部分货款尚未收到，应填制的记账凭证是？',
				'xx'=>['收款和转账凭证','付款和转账凭证','收款和付款凭证','两张转账凭证'],				 
				'da'=>[1,0,0,0],
			],
			[
				'tm'=>'某上市公司会计人员把公司2017年7月发生的销售商品业务在2017年10月才登记人账，这违背了（ ）会计信息质量要求？',
				'xx'=>['可靠性','相关性','及时性','可比性'],
				'da'=>[0,0,1,0],
			],
		];
		//var_dump($ti);exit;

		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
