<?php namespace mdl;

/*
 * 试题：大数据
 * 20181106
 */
class dsj extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[
				'tm'=>'当前大数据技术的基础是由（ ）首先提出的？',
				'xx'=>['微软','百度','谷歌','阿里巴巴'],
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'大数据的起源是（  ）？',
				'xx'=>['金融','电信','互联网','公共管理'],
				'da'=>[0,0,1,0],
			]
			,
			[
				'tm'=>'智慧城市的构建，不包含（  ）？',
				'xx'=>['数字城市 ','物联网 ','联网监控 ','公共管理'],
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'大数据的最显著特征是（  ）？',
				'xx'=>['数据规模大','数据类型多样','数据处理速度快','数据价值密度高'],
				'da'=>[1,0,0,0],
			]
			,[
				'tm'=>'当前社会中，最为突出的大数据环境是（ ）？',
				'xx'=>['互联网','物联网','综合国力','自然资源'],
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'Window系统的开发者是（  ）？',
				'xx'=>['微软公司', '惠普公司', '苹果公司', 'IBM公司'],
				'da'=>[1,0,0,0],
			]
			,[	
				'tm'=>'大数据时代，数据使用的关键是（  ）？',
				'xx'=>['数据收集','数据存储','数据分析','数据再利用'],
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'下列论据中，能够支撑“大数据无所不能”的观点的是（ ）？',
				'xx'=>['互联网金融打破了传统的观念和行为','大数据存在泡沫','大数据具有非常高的成本','个人隐私泄露与信息安全担忧'],
				'da'=>[1,0,0,0],
			]
			,[
				'tm'=>'计算机在工作过程中突然断电，会丢失所保存信息的存储介质是（）？',
				'xx'=>['光盘','硬盘','只读存储器','内存'],
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'在Internet的域名中，代表计算机所在的国家或地区的符号”.cn”是指（）？',
				'xx'=>['中国','电台湾信','香港','加拿大'],
				'da'=>[1,0,0,0],
			]
			,[
				'tm'=>'Hacher是指那些私闯非公开的机构网络进行破坏的人，它的中文俗称是（）?',
				'xx'=>['朋克','海客','网虫','黑客'],
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'域名中的后缀.com表示机构所属类型是（）？',
				'xx'=>['军事机构','政府机构','教育机构','商业公司'],
				'da'=>[0,0,0,1],
			]
			,[
				'tm'=>' 1  8  27  ()  请写出(  )内的数字',
				'xx'=>[30,64,37,50],
				'da'=>[0,1,0,0],
			]
			,
			[
				'tm'=>'根据大图形中的符号或图案的规律，选择适当的图案填入大图形的空缺中？ ',
				'img'=>'t1_dsj_13.jpg',
				'xx'=>[1,2,3,4,5,6],
				'da'=>[0,0,0,1,0,0],
			]
			,
			[
				'tm'=>'根据大图形中的符号或图案的规律，选择适当的图案填入大图形的空缺中？',
				'img'=>'t1_dsj_14.jpg',
				'xx'=>[1,2,3,4,5,6],
				'da'=>[0,0,1,0,0,0],
			]
			,

		];
		shuffle($ti);
		return $ti;

		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
