<?php namespace mdl;

/*
 * 试题：短视频与新媒体运营
 * 20191223180410
 */
class dsp extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[	
				'tm'=>'以下哪种媒介为新媒体形式？',
				'img'=>'t1_dsp_0.jpg',
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'以下哪种软件是短视频类型的新媒体软件？',
				'img'=>'t1_dsp_1.jpg',
				'da'=>[0,1,0,0],
			]
			,
			[
				'tm'=>'注册抖音号是否是需要花钱的？',
				'xx'=>['需要','不需要'],
				'da'=>[0,1],
			]
			,
			[	
				'tm'=>'以下选项中资讯类新媒体软件是哪个？',
				'img'=>'t1_dsp_3.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[	
				'tm'=>'拍摄视频素材时，某一分镜只要拍出了符合要求的合格视频，就可以继续拍摄下一个分镜了，这是正确还是错误的？',
				'xx'=>['正确','错误 '],
				'da'=>[1,0]
			]
			,
			[
				'tm'=>'个人网络直播中会用到以下哪种设备？',
				'img'=>'t1_dsp_5.jpg',
				'da'=>[1,0,0,0],
			]
			,
			[
				'tm'=>'为抖音打造人设时，可以用人设“三问”原则，以下哪个不属于“三问”？ ',
				'xx'=>['我是谁','我需要什么','我是来干什么的','凭什么喜欢我'],
				'da'=>[0,1,0,0],
			]
			,
			[
				'tm'=>'你认为的视频剪辑的大致流程应该是怎样的一个顺序？',
				'xx'=>['①②③④','④③②①','②③①④','①③②④'],
				'img'=>'t1_dsp_7.jpg',
				'da'=>[1,0,0,0]

			]
			,
			[
				'tm'=>'创新要去的成功，不仅要提出创造性的想法，还需要我们？ ',
				'xx'=>['提出更多困难','挖掘更多不可思议想法','提出相应解决方案','坐享其成'],
				'da'=>[0,0,1,0],
			]
			,
             [	
				'tm'=>'如果你现在拥有一个粉丝超百万的短视频账号，你应该怎么去做？',
				'xx'=>[
					'只需要维护好这个账号就好了'
					,'想法把这个账号卖了套现'
					,'维护好这个账号的同时去开辟其他新的账号'
					,'账号已经百万了就不需要怎么费心去维护了'
				],
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪项不是短视频前期拍摄的最佳必需品？',
				'img'=>'t1_dsp_10.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'下列属于抖音一般用户拍摄时长的是？',
				'xx'=>['15秒','2分钟','3分钟','4分钟'],
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'下列哪项属于视频剪辑软件的是？',
				'xx'=>['Premiere','天天P图','美颜相机','美图秀秀'],
				'da'=>[1,0,0,0]
			]
			,
			[	
				'tm'=>'下列表述正确的是？',
				'xx'=>[
					'手机是专门用来拍摄短视频的机器'
					,'抖音是短视频发布的平台'
					,'焦距越长，景深越大'
					,'光圈值越大，光圈越大'
				],
				'da'=>[0,1,0,0]
			]
			,
			[
				'tm'=>'下列哪个选项不是的三原色？(答案可能错误)',
				'xx'=>['红色','蓝色','黄色','绿色'],
				'da'=>[0,0,1,0]
			]
			,
		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
