<?php namespace mdl;
/*
 * 试题：电子竞技运管精英
 * 20181011
 */
 class dzjj extends _base
 {
 	const C1=15;//--> 人工计算ti数组数目

	
//试题
	 public function t1($sn=0)
	{
		$ti=
		[
			[	
				'tm'=>'英雄联盟中，段位最低的是哪个段位？',
				'xx'=>["黑铁","青铜","黄铜","白银"],
				'da'=>[0,1,0,0]
			]
			,
			[
				'tm'=>'下列哪个英雄没有控制技能？',
				'img'=>'t1_dzjj_1.jpg',
				'da'=>[1,0,0],
			]
			,
			[
				'tm'=>'绝地求生中以下枪械中伤害最高的是哪支？',
				'img'=>'t1_dzjj_2.jpg',
				'da'=>[0,0,0,1],
			]
			,
			[
				'tm'=>'绝地求生中车速最高的车是哪辆车？',
				'img'=>'t1_dzjj_3.jpg',
				'da'=>[0,0,1,0],
			]
			,
			[
				'tm'=>'下列哪个游戏是射击游戏？',
				'img'=>'t1_dzjj_4.jpg',
				'da'=>[1,0,0,0],
			]
			,
			[
				'tm'=>'绝地求生中98K能不能打爆三级头？',
				'xx'=>["能","不能"],
				'da'=>[0,1],
			]
			,
			[
				'tm'=>'绝地求生中下列图片最高的倍镜是几倍？',
				'img'=>'t1_dzjj_6.jpg',
				'da'=>[0,0,0,1],
			]
			,
			[
				'tm'=>'2018年的LPL夏季赛RNG战队VS RW战队中第二场那个比赛上谁用薇恩拿下了四杀？',
				'xx'=>["MLXG","MING","UZI","XIAOHU"],
				'da'=>[0,0,1,0],
			]
			,
			[
				'tm'=>'现在英雄联盟中30级是否是满级？',
				'xx'=>["是","不是"],
				'da'=>[0,1],
			]
			,
			[
				'tm'=>'英雄联盟中faker被称为神，因为SKT多次卫冕冠军那么SKT获得过几连冠？',
				'xx'=>["1连冠","3连冠","5连冠","6连冠"],
				'da'=>[0,1,0,0],
			]
			,
			[
				'tm'=>'英雄联盟上2018年中RNG战队获得了六次冠军，请问哪个是RNG战队的最强上单？',
				'xx'=>["姿态","UZI","letme","Kasar"],
				'da'=>[0,0,1,0],
			]
			,
			[
				'tm'=>'英雄联盟角色中，亚索一直是大家经常玩的英雄，那么请问亚索的大招叫什么名字？',
				'xx'=>["雷霆半月斩","狂风绝息斩","断钢闪"],
				'da'=>[0,1,0],
			]
			,
			[
				'tm'=>'在英雄联盟战队中RNG战队一直是骄傲，那么RNG战队其他位置一直有替补但唯一没有替补的是哪个位置？',
				'xx'=>["上路","下路","辅助"],
				'da'=>[0,0,1],
			]
			,
			[
				'tm'=>'绝地求生中三级套装一直是大家最想要的东西，下列那个图片和三级套装无关？',
				'img'=>'t1_dzjj_13.jpg',
				'da'=>[1,0,0,0],
			]
			,
			[
				'tm'=>'英雄联盟中‘让我们来猎杀那些陷入黑暗中的人吧’出自哪位英雄的台词？',
				'img'=>'t1_dzjj_14.jpg',
				'da'=>[0,0,1,0],
			]
			,
		];
		//var_dump($ti);exit;

		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
 	}

 }
