<?php namespace mdl;

/*
 * 试题：互联网+会展
 * 20181106
 */
class hz extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[
				'tm'=>'根据大家的习惯说法，下面哪个城市是不属于中国的“三大会展城市”?',
				'img'=>'t1_hz_0.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'下列物体中那个是VR眼镜？',
				'img'=>'t1_hz_1.jpg',
				'da'=>[0,1,0,0]
			]
			,
			[
				'tm'=>'下面那个软件是建模软件？',
				'img'=>'t1_hz_2.jpg',
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'下列哪幅画是素描？',
				'img'=>'t1_hz_3.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪个是会展设计效果图？',
				'img'=>'t1_hz_4.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'下列哪个是3D打印机？',
				'img'=>'t1_hz_5.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'会展搭建时一般用的框架是下列哪个？',
				'img'=>'t1_hz_6.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'下列哪个是郑州CBD会展中心？',
				'img'=>'t1_hz_7.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪个是城市模型？',
				'img'=>'t1_hz_8.jpg',
				'da'=>[0,1,0,0]
			]
			,
			[
				'tm'=>'下列哪个是会展现场？',
				'img'=>'t1_hz_9.jpg',
				'da'=>[0,0,0,1]
			]
			,
			[
				'tm'=>'下列哪个是喷绘作品？',
				'img'=>'t1_hz_10.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪个是平面布置图？',
				'img'=>'t1_hz_11.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪个是kt板？',
				'img'=>'t1_hz_12.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[
				'tm'=>'下列哪些是舞台灯光？',
				'img'=>'t1_hz_13.jpg',
				'da'=>[1,0,0,0]
			]
			,
			[
				'tm'=>'会展一般常用的展架是下列哪个？',
				'img'=>'t1_hz_14.jpg',
				'da'=>[0,0,1,0]
			]
		];
		//var_dump($ti);exit;

		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
