<?php namespace mdl;

/*
 * 建筑装饰创意设计师
 * 20191229085335
 */
class jzzs extends _base
{
	const C1=15;//--> 人工计算ti数组数目
	const NAME='建筑装饰创意设计师';

	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			0=>[	
				'tm'=>'下列哪个图片是中国古代建筑？',
				'img'=>'t1_jzzs_0.jpg',
				//'xx'=>['选项1','选项2','选项3','选项4',],
				'da'=>[0,0,1,0]
			],
			1=>[	
				'tm'=>'下列明星中，哪一位是跨界室内设计师？',
				'img'=>'t1_jzzs_1.jpg',
				//'xx'=>['选项1','选项2','选项3','选项4',],
				'da'=>[0,0,0,1]
			],
			
            2=>[	
				'tm'=>'为什么选择VR空间创意设计师？',
				// 'img'=>'t1_jzzs_1.jpg',
				'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
				'da'=>[1,1,1,1]
			],

         	3=>[	
				'tm'=>'下面哪款软件是3D软件？',
				 'img'=>'t1_jzzs_3.jpg',
				// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
				'da'=>[0,0,1]
			],
            4=>[	
				'tm'=>'如果你即将设计一个轰趴馆，那么你没必要去体验的空间是？',
				 'img'=>'t1_jzzs_4.jpg',
				// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
				'da'=>[1,0,0,0]
			],

	     	5=>[	
					'tm'=>'如果你去量房，你没必要带的工具是？',
					 'img'=>'t1_jzzs_5.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,0,1]
				],


	   		6=>[	
					'tm'=>'下列软件哪个是做VR虚拟交互设计的？',
					'img'=>'t1_jzzs_6.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[1,0,0,0]
				],

	    	7=>[	
					'tm'=>'以下哪种颜色给人感觉环保？',
					 'img'=>'t1_jzzs_7.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[1,0,0,0]
				],


	    	8=>[	
					'tm'=>'下列图片中属于建筑手绘的是？',
					 'img'=>'t1_jzzs_8.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,1,0]
				],
	    	9=>[	
					'tm'=>'以下哪个是制作室内效果图的软件	？',
					 'img'=>'t1_jzzs_9.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,0,1]
				],

	    	10=>[	
					'tm'=>'下列图片哪个属于地中海风格？',
					 'img'=>'t1_jzzs_10.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,0,1]
				],

	    	11=>[	
					'tm'=>'下列是空间设计师工作场景的是？',
					 'img'=>'t1_jzzs_11.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,0,1]
			],

	    	12=>[	
					'tm'=>'下列选项中哪个是HTC VR眼镜？',
					'img'=>'t1_jzzs_12.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,0,1]
			],
		    13=>[	
					'tm'=>'下列建筑图片中属于曲面建筑的是？',
					 'img'=>'t1_jzzs_13.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[1,0,0,0]
			],
		    14=>[	
					'tm'=>'你在校园里种下一棵小树，你希望几年后小树会？',
					 'img'=>'t1_jzzs_14.jpg',
					// 'xx'=>['高收入','想学习一门技术','喜欢设计','想从事设计有关的工作',],
					'da'=>[0,0,1]
			],


		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
