<?php namespace mdl;

/*
 * 试题：网站开发工程师(原互联网平台开发工程师)
 * 20181017
 */
class web extends _base
{
	const C1=15;//--> 人工计算ti数组数目
	const NAME='网站开发工程师';

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[
				'tm'=>'以下哪个是我国网民常用的搜索引擎？',
				'img'=>'t1_web_0.png',
				'da'=>[0,1,0]
			]
			,
			[
				'tm'=>'网站可以通过什么软件制作？',
				'img'=>'t1_web_1.png',
				'da'=>[1,0,0]
			]
			,
			[
				'tm'=>'在域名类型中，.com的域名属于哪种机构类型？',
				'xx'=>['商业机构','教育机构','军事机构'],
				'da'=>[1,0,0]
			]
			,
			[
				'tm'=>'HTML语言是指？',
				'img'=>'t1_web_3.png',
				'da'=>[0,1,0]
			]
			,
			[
				'tm'=>'下面哪一个是正确的邮箱地址？',
				'xx'=>['123@.qq.com','123qq@.com','123@qq.com'],
				'da'=>[0,0,1]
			]
			,
			[
				'tm'=>'下面搜索引擎是网站吗？',
				'img'=>'t1_web_5.png',
				'da'=>[0,1,0]
			],
			[
				'tm'=>'电脑上最重要的软件是？',
				'xx'=>['系统软件','QQ','记事本'],
				'da'=>[1,0,0]
			],
			[
				'tm'=>'网站的功能有哪些？',
				'xx'=>['提供网站浏览内容','制作大头贴','治理雾霾'],
				'da'=>[1,0,0]
			],
			[
				'tm'=>'“钓鱼网站”是指？',
				'xx'=>['社交网站','钓鱼活动的网站','诈骗网站'],
				'da'=>[0,0,1]
			],
			[
				'tm'=>'黑客攻击网站用的是？',
				'img'=>'t1_web_9.png',
				'da'=>[1,0,0]
			],
			[
				'tm'=>'以下哪一种软件不属于社交软件？',
				'img'=>'t1_web_10.png',
				'da'=>[0,1,0]
			],
			[
				'tm'=>'你在校园里种下一棵小树，你希望几年后小树会？',
				'img'=>'t1_web_11.png',
				'da'=>[0,0,1]
			],
			[
				'tm'=>'下列图标哪一个代表IE浏览器？',
				'img'=>'t1_web_12.png',
				'da'=>[1,0,0]
			],
			[
				'tm'=>'代码编写是用？',
				'xx'=>['中文','俄文','英文'],
				'da'=>[0,0,1]
			],
			[
				'tm'=>'你认为下列哪张图片能表示热烈，喜庆的意思？',
				'img'=>'t1_web_14.png',
				'da'=>[0,1,0]
			],
			[
				'tm'=>'APP是指？',
				'xx'=>['操作系统','电脑硬件','不知道','手机应用'],
				'da'=>[0,0,0,1]
			],
			[
				'tm'=>'网站维护是指？',
				'xx'=>['打扫网站','维修主机 ','网站正常运行 '],
				'da'=>[0,0,1]
			],
		];
		//var_dump($ti);exit;

		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
