<?php namespace mdl;

/*
 * 试题：无人机专业
 * 20191229085335
 */
class wrj extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[	
				'tm'=>'以下不属于无人机的是？',
				'img'=>'t1_wrj_0.jpg',
				'da'=>[0,0,1,0]
			],
			[	
				'tm'=>'轻型无人机，是指空机质量？',
				'xx'=>['小于1kg','大于7kg，小于116kg','大于116kg，小于5700kg'],
				'da'=>[0,1,0]
			],
			[	
				'tm'=>'不属于无人机系统的是？',
				'xx'=>['飞行器平台','飞行员','导航飞控系统'],
				'da'=>[0,1,0]
			],
			[	
				'tm'=>'不属于无人机起飞方式的是？',
				'xx'=>['弹射','滑跑','滑翔'],
				'da'=>[0,0,1]
			],
			[	
				'tm'=>'关于实操授课的描述，以下哪一项是错误的？',
				'xx'=>['教员应向学员演示合理正确的动作，并时刻指正学员的错误','航拍无人机都非常安全，学员实操时教员无需在旁边指导','教员应以身作则，不要演示没有意义的危险动作','保证学员和教员的人身安全是实操训练第一准则'],
				'da'=>[0,1,0,0]
			],
			[	
				'tm'=>'关于航拍作业的准备工作，以下描述不正确的是？',
				'xx'=>['需检查飞行器状态','需检查SD卡剩余容量','需检查电池电量','无需做任何准备'],
				'da'=>[0,0,0,1]
			],
			[	
				'tm'=>'当飞行器指南针校准失败时，应()处理？',
				'xx'=>['继续飞行','结束校准','重新校准指南针','重启遥控器'],
				'da'=>[0,0,1,0]
			],

            [	
				'tm'=>'下面哪一项属于可正常飞行区域？',
				'img'=>'t1_wrj_7.jpg',
				'da'=>[0,1,0,0]
			],
            [	
				'tm'=>'无人机航空摄影在我们现实生活中的应用中，主要不包括的是？',
				'xx'=>['测绘','农业植保喷洒农药','灾区搜救 ','赛事直播'],
				'da'=>[0,1,0,0]
			],
			[	
				'tm'=>'当前国内民用无人机的主要控制方式不包括？',
				'xx'=>['自主控制','人工遥控','人工智能'],
				'da'=>[0,0,1]
			],
			[	
				'tm'=>'关于720全景拍摄，以下描述不正确的是?',
				'xx'=>['通常使用AEB包围曝光','每张照片不需要重合','由多张照片叠加而成','需要软件后期处理'],
				'da'=>[0,1,0,0]
			],
			[	
				'tm'=>'在动作和体育摄影中，以下描述不正确的是?',
				'xx'=>['时机是关键','无需观察和预测动作','需要提前做好计划','用高速快门凝固瞬间动作'],
				'da'=>[0,1,0,0]
			],
			[	
				'tm'=>'以下负责控制无人机高度的是?',
				'xx'=>['气压计','高度计','视觉感知','GPS'],
				'da'=>[0,1,0,0]
			],
			[	
				'tm'=>'以下哪种天气不适合飞行?',
				'img'=>'t1_wrj_13.jpg',
				'da'=>[0,0,1,0]
			],
			[	
				'tm'=>'航拍手段不包括?',
				'xx'=>['载人直升机拍摄','热气球拍摄','无人机拍摄','地面拍摄'],
				'da'=>[0,0,0,1],
			],


		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
