<?php namespace mdl;

/*
 * 试题：云电子商务运营
 * 20181017
 */
class yds extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
	        [
	            'tm'=>'下面哪个电商平台可以开设个人网店？',
	            'img'=>'t1_yds_0.png',//t1_代号_数组的序号.jpg
	            'da'=>[0,1,0,0]
	        ],
	        [
	            'tm'=>'以下哪个平台不属于阿里巴巴旗下品牌？',
	            'img'=>'t1_yds_1.png',
	            'da'=>[0,1,0,0]
	        ],
	        [
	            'tm'=>'与淘宝卖家比较安全的沟通工具有？',
	            'img'=>'t1_yds_2.png',
	            'da'=>[0,1,0,0]
	        ],
	        [
	            'tm'=>'以下哪些网站不属于搜索引擎平台？',
	            'img'=>'t1_yds_3.png',
	            'da'=>[0,0,0,1]
	        ],
	        [
	            'tm'=>'天猫中可以发布哪类商品？',
	            'xx'=>['拍卖商品','二手闲置商品','正品行货','全新外贸'],
	            'da'=>[0,0,1,0]
	        ],
	        [
	            'tm'=>'下列哪些产品在淘宝网无法购买？',
	            'img'=>'t1_yds_5.png',
	            'da'=>[0,0,1,0]
	        ],
	        [
	            'tm'=>'下列哪个不属于网上支付平台?',
	            'img'=>'t1_yds_6.png',
	            'da'=>[0,0,1,0]
	        ],
	        [
	            'tm'=>'不属于问答营销平台的网站是？',
	            'img'=>'t1_yds_7.png',
	            'da'=>[0,0,0,1]
	        ],
	        [
	            'tm'=>'1997年首家推出国内“一网通”网上支付工具的商业银行是？',
	            'img'=>'t1_yds_8.png',
	            'da'=>[0,1,0,0]
	        ],
	        [
	            'tm'=>'在淘宝上搜索需购买物品时，展示物品默认的排序方式是？',
	            'img'=>'t1_yds_9.png',
	            'da'=>[0,0,0,1]
	        ],
	        [
	            'tm'=>'下列选项中，属于国有快递企业的是？',
	            'img'=>'t1_yds_10.png',
	            'da'=>[0,0,1,0]
	        ],
	        [
	            'tm'=>'阿里巴巴的创始人是下列哪位?',
	            'img'=>'t1_yds_11.png',
	            'da'=>[0,1,0,0]
	        ],
	        [
	            'tm'=>'小芳在淘宝上购买了一条牛仔裤，但是没有购买运费险，小芳在收到货物之后觉得不喜欢，想要退货，请问运费由谁承担？',
	            'xx'=>['小芳承担来回运费','卖家承担来回运费','阿里巴巴承担运费','与商家协商解决'],
	            'da'=>[1,0,0,0]
	        ],
	        [
	            'tm'=>'服务号是微信公众平台的一种账号类型，旨在为用户提供服务。以下不属于服务号类型的是？',
	            'img'=>'t1_yds_13.png',
	            'da'=>[0,0,0,1]
	        ],
	        [
	            'tm'=>'淘宝店铺中，以下哪项不属于大家电的范围？',
	            'img'=>'t1_yds_14.png',
	            'da'=>[0,0,1,0]
	        ],
		];
		//var_dump($ti);exit;

		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
