<?php namespace mdl;

/*
 * 试题：云计算网络工程师
 * 20181011
 */
class yun extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[	
				'tm'=>'以下哪个不是我国互联网服务提供商? ',
				'img'=>'t1_yun_0.jpg',
				'da'=>[0,1,0,0]
			]
			,
			[
				'tm'=>'网络不可以使用的传输介质是？',
				'xx'=>['网线','光纤','绳子'],
				'da'=>[0,0,1],
			]
			,
			[
				'tm'=>'网络中提供服务的设备称为？',
				'xx'=>['服务器','客户机','路由器'],
				'da'=>[1,0,0],
			]
			,
			[	
				'tm'=>'不是网络设备生产厂商的是？',
				'img'=>'t1_yun_3.jpg',
				'da'=>[0,0,1,0]
			]
			,
			[	
				'tm'=>'哪个设备不能共享wifi？',
				'img'=>'t1_yun_4.jpg',
				'da'=>[0,0,1]
			]
			,
			[
				'tm'=>'可以用于连接，并使用下面标志代表的网站搜索网络资源的是？',
				'img'=>'t1_yun_5.jpg',
				'xx'=>['Ethernet','Intranet ','Internet'],
				'da'=>[0,0,1],
			]
			,
			[
				'tm'=>'那个线缆传输数据的速度最快？ ',
				'xx'=>['电话线','光纤','WIFI'],
				'da'=>[0,1,0],
			]
			,
			[
				'tm'=>'通过网络不能做的是？',
				'img'=>'t1_yun_7.jpg',
				'da'=>[0,0,1]
			]
			,
			[
				'tm'=>'手机QQ突然不能联网的原因可能是？ ',
				'xx'=>['电脑停电','没有wifi','手机中病毒'],
				'da'=>[0,0,1],
			]
			,
             [	
				'tm'=>'以下哪一种软件不属于社交软件？',
				'img'=>'t1_yun_9.jpg',
				'da'=>[0,1,0]
			]
			,
			[
				'tm'=>'哪个U盘存储大？',
				'img'=>'t1_yun_10.jpg',
				'da'=>[0,1,0]
			]
			,
			[
				'tm'=>'哪个无线路由器速度更快？',
				'img'=>'t1_yun_11.jpg',
				'da'=>[0,1,0]
			]
			,
			[
				'tm'=>'不可以上传文件的是？',
				'img'=>'t1_yun_12.jpg',
				'da'=>[0,0,1]
			]
			,
			[	
				'tm'=>'属于电子商务网站的是？',
				'img'=>'t1_yun_13.jpg',
				'da'=>[1,0]
			]
			,
			[
				'tm'=>'属于音频的文件是？',
				'img'=>'t1_yun_14.jpg',
				'da'=>[0,1]
			]
			,
		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
