<?php namespace mdl;

/*
 * 试题：综合测试
 * 20181001
 */
class zhcs extends _base
{
	const C1=15;//--> 人工计算ti数组数目

	
	//试题
	public function t1($sn=0)
	{
		$ti=
		[
			[
				'tm'=>'根据大家的习惯说法，下面哪个城市是不属于中国的“三大会展城市”?',
				'img'=>'t1_hz_0.jpg',
				'da'=>[1,0,0,0]
			]
			,[
				'tm'=>'在域名类型中，.com的域名属于哪种机构类型？',
				'xx'=>['商业机构','教育机构','军事机构'],
				'da'=>[1,0,0]
			]
			,[
				'tm'=>'以下设备哪个像素更好？',
				'img'=>'t1_ysdm_2.png',
				'da'=>[1,0,0,0],
			]
			,[
				'tm'=>'下列哪项不属于网络支付方式？',
				'img'=>'t1_cw_4.jpg',
				'da'=>[0,0,0,1],
			]
			,[
	            'tm'=>'天猫中可以发布哪类商品？',
	            'xx'=>['拍卖商品','二手闲置商品','正品行货','全新外贸'],
	            'da'=>[0,0,1,0]
	        ]
	        ,[
		        'tm'=>'如果一个网咖的老板，让你为他选择他的网咖的座椅，你会帮他选哪个？',  //题目
		        'img'=>"t1_kjcy_8.jpg",    //图片路径
		        'da'=>[1,0,0,0]     //答案
		    ]
		    ,[
				'tm'=>'.以下属于娱乐短视频类应用的是？',
				'img'=>'t1_ui_1.jpg',
				'da'=>[0,0,1,0]
			]
			,[
				'tm'=>"根据大图形中的符号或图案的规律，选择适当的图案填入大图形的空缺中？",
				'img'=>'t1_rgzn_4.jpg',
				'xx'=>['1','2','3','4','5','6'],
				'da'=>[0,0,0,1,0,0],
			]
			,[
				'tm'=>'绝地求生中以下枪械中伤害最高的是哪支？',
				'img'=>'t1_dzjj_2.jpg',
				'da'=>[0,0,0,1],
			]
			,[
				'tm'=>'网络不可以使用的传输介质是？',
				'xx'=>['网线','光纤','绳子'],
				'da'=>[0,0,1],
			]
			,[	//题目timu
				'tm'=>'找出与众不同的一个？',
				//选项xuanxiang
				'xx'=>['触', '视','听','吃','嗅'],
				//答案daan
				'da'=>[0,0,0,1,0]
            ]
			,[
				'tm'=>'Window系统的开发者是（  ）？',
				'xx'=>['微软公司', '惠普公司', '苹果公司', 'IBM公司'],
				'da'=>[1,0,0,0],
			]
			,[
				'tm'=>'哪个U盘存储大？',
				'img'=>'t1_yun_10.jpg',
				'da'=>[0,1,0]
			]
			,[	//题目timu
				'tm'=>'以下软件中，（ ）不是操作系统？',
				//选项xuanxiang
				'xx'=>['Window XP', 'unix', 'linux', 'microsoft office'],
				//答案daan
				'da'=>[0,0,0,1,]
            ]
            ,[
				'tm'=>"盲人看不到一切事物，他们可以通过不同的人的声音辨别发声者，这是智能的( )方面？",
				//'img'=>'t1_6.jpg',
				'xx'=>['行为能力', '感知能力 ','思维能力','学习能力'],
				'da'=>[0,1,0,0],
			]
            ,[	
				'tm'=>'下面哪个是游戏场景设计？',
				'img'=>'t1_yxkf_6.jpg',
				'da'=>[0,1,0,0]
			],

		];
		//var_dump($ti);exit;
		shuffle($ti);
		return $ti;
		return isset($ti[$sn]) ? $ti[$sn] : false;	
	}


}
